app/controllers/application_controller.rb

    def correct_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1