app/controllers/pannes_controller.rb

  def index
    if logged_in?
      @pannes = Panne.paginate(page: params[:page], :per_page => 10)
---
SELECT  `pannes`.* FROM `pannes` ORDER BY `pannes`.`created_at` DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `pannes`

  def edit
    @action='edit'
    @panne = Panne.find(params[:id])
---
SELECT  `pannes`.* FROM `pannes` WHERE `pannes`.`id` = 1 ORDER BY `pannes`.`created_at` DESC LIMIT 1

  def create
    panne_params[:panne_status]='Non Résolue';
    panne_params[:tech_id]='1';
    @panne = current_user.created_pannes.build(panne_params)
    if @panne.save
---
INSERT INTO `pannes` (`description`, `type_panne`, `laboratoire`, `type_Composant`, `id_Composant`, `prof_id`, `tech_comment`, `panne_status`, `created_at`, `updated_at`) VALUES ('Problem', 'Hardware', 'Lab-001', 'PC', 'PC-001', 2, '', 'NonResolu', '2018-07-27 17:12:10', '2018-07-27 17:12:10')
INSERT INTO `pannes` (`description`, `type_panne`, `laboratoire`, `type_Composant`, `id_Composant`, `prof_id`, `tech_id`, `panne_status`, `created_at`, `updated_at`) VALUES ('Probleme d\'imprimante', 'Hardware', 'Lab-001', 'Imprimante', 'Epson-0101010', 5, 1, 'Non Résolue', '2018-07-27 21:12:38', '2018-07-27 21:12:38')

  def update
    @panne = Panne.find(params[:id])
    panne_params[:tech_id]=current_user.id
    if @panne.update_attributes(panne_params)
---
SELECT  `pannes`.* FROM `pannes` WHERE `pannes`.`id` = 1 ORDER BY `pannes`.`created_at` DESC LIMIT 1
UPDATE `pannes` SET `panne_status` = 'Résolue', `tech_comment` = 'acheter cable\r\ncable achetee le dddddd', `updated_at` = '2018-07-28 13:28:35' WHERE `pannes`.`id` = 1

  def destroy
    @panne = Panne.find(params[:id])
    @panne.destroy
---
SELECT  `pannes`.* FROM `pannes` WHERE `pannes`.`id` = 2 ORDER BY `pannes`.`created_at` DESC LIMIT 1
DELETE FROM `pannes` WHERE `pannes`.`id` = 2

    def set_panne
      begin
        @panne = Panne.find(params[:id])
---
SELECT  `pannes`.* FROM `pannes` WHERE `pannes`.`id` = 1 ORDER BY `pannes`.`created_at` DESC LIMIT 1