app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE (LOWER(login) = 'admin') LIMIT 1
---
  def create
    user = User.find_by("LOWER(login) = ?", user_params[:login].downcase)