app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    @users = User.paginate(page: params[:page], :per_page => 5)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
---
  def show
    begin
      @user = User.find(params[:id])

INSERT INTO `users` (`login`, `nom`, `prenom`, `email`, `utype`, `password_digest`, `created_at`, `updated_at`) VALUES ('adnenr', 'Rouatbi', 'Adnen', 'rouatbiadnen@isetso.rnu.tn', 'Professeur', '$2a$10$T0ZXxQAYYHXQ1nYhblt5iusIBFwfgKW3e.38PHo.ch0u.1/kS99ni', '2018-07-28 13:23:58', '2018-07-28 13:23:58')
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1  [["id", 3], ["LIMIT", 1]]
UPDATE `users` SET `email` = 'ad.rouatbi@gmail.com', `password_digest` = '$2a$10$fs.zd.kopLMDNtwRKSaFWeO70bSnzkkkShPlmVRJP8GSh091NEI26', `updated_at` = '2018-07-28 14:07:27' WHERE `users`.`id` = 2
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)

DELETE FROM `users` WHERE `users`.`id` = 3
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def destroy
    User.find(params[:id]).destroy